# ── Taps ──────────────────────────────────────────────────────────────────────
tap "hashicorp/tap"

# ── Shell ─────────────────────────────────────────────────────────────────────
brew "zsh"

# ── Core Utilities ────────────────────────────────────────────────────────────
brew "git"
brew "git-lfs"
brew "gh"           # GitHub CLI
brew "curl"
brew "wget"
brew "jq"           # JSON processor
brew "yq"           # YAML processor
brew "bat"          # better cat
brew "eza"          # better ls
brew "fd"           # better find
brew "ripgrep"      # better grep
brew "fzf"          # fuzzy finder
brew "htop"
brew "tree"
brew "tmux"
brew "vim"
brew "neovim"
brew "gnupg"
brew "pinentry-mac"
brew "age"          # modern encryption
brew "sops"         # secret management
brew "direnv"       # per-directory env vars
brew "zoxide"       # smarter cd
brew "gum"          # shell script UX
brew "mkcert"       # local TLS certs
brew "asdf"         # version manager
brew "withgraphite/tap/graphite" # graphite CLI

# ── Cloud CLIs ────────────────────────────────────────────────────────────────
# Note: AWS CLI v2 is installed via native pkg in setup.sh (brew version lags)
brew "aws-vault"
brew "aws-iam-authenticator"
cask "gcloud-cli"
brew "azure-cli"

# ── IaC ───────────────────────────────────────────────────────────────────────
brew "tfenv"           # manages terraform versions — do not install terraform separately
brew "terragrunt"
brew "tflint"
brew "terraform-docs"
brew "tfsec"
brew "infracost"

# ── Containers & Kubernetes ───────────────────────────────────────────────────
brew "docker"
brew "docker-compose"
brew "colima"          # lightweight Docker daemon (no Docker Desktop needed)
brew "kubectl"
brew "kubectx"         # includes kubens
brew "kustomize"
brew "helm"
brew "helmfile"
brew "k9s"
brew "stern"           # multi-pod log tailing
brew "krew"            # kubectl plugin manager

# ── Fonts & Terminal ──────────────────────────────────────────────────────────
cask "font-meslo-lg-nerd-font"   # p10k recommended font (MesloLGS NF)
# cask "warp"

# ── Networking & Security ─────────────────────────────────────────────────────
brew "nmap"
brew "netcat"
brew "tcpdump"
brew "trivy"           # container vulnerability scanner
brew "step"            # cert management
brew "cfssl"
